In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("Data Science Job posts.csv")

In [4]:
df.head()

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
0,data scientist,senior,hybrid,company_003,"Grapevine, TX . Hybrid",17 days ago,"Bentonville, AR, US",Retail,Public,€352.44B,Public,"€100,472 - €200,938","['spark', 'r', 'python', 'scala', 'machine lea..."
1,data scientist,lead,hybrid,company_005,"Fort Worth, TX . Hybrid",15 days ago,"Detroit, MI, US",Manufacturing,Public,"155,030",€51.10B,"€118,733","['spark', 'r', 'python', 'sql', 'machine learn..."
2,data scientist,senior,on-site,company_007,"Austin, TX . Toronto, Ontario, Canada . Kirkla...",a month ago,"Redwood City, CA, US",Technology,Public,"25,930",€33.80B,"€94,987 - €159,559","['aws', 'git', 'python', 'docker', 'sql', 'mac..."
3,data scientist,senior,hybrid,company_008,"Chicago, IL . Scottsdale, AZ . Austin, TX . Hy...",8 days ago,"San Jose, CA, US",Technology,Public,"34,690",€81.71B,"€112,797 - €194,402","['sql', 'r', 'python']"
4,data scientist,NaN,on-site,company_009,On-site,3 days ago,"Stamford, CT, US",Finance,Private,"1,800",Private,"€114,172 - €228,337",[]

In [11]:
df.dtypes

job_title          object
seniority_level    object
status             object
company            object
location           object
post_date          object
headquarter        object
industry           object
ownership          object
company_size       object
revenue            object
salary             object
skills             object
dtype: object

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 944 entries, 0 to 943
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   job_title        941 non-null    object
 1   seniority_level  884 non-null    object
 2   status           688 non-null    object
 3   company          944 non-null    object
 4   location         942 non-null    object
 5   post_date        944 non-null    object
 6   headquarter      944 non-null    object
 7   industry         944 non-null    object
 8   ownership        897 non-null    object
 9   company_size     944 non-null    object
 10  revenue          929 non-null    object
 11  salary           944 non-null    object
 12  skills           944 non-null    object
dtypes: object(13)
memory usage: 96.0+ KB

In [6]:
# Check for missing values
df.isnull().sum()

job_title            3
seniority_level     60
status             256
company              0
location             2
post_date            0
headquarter          0
industry             0
ownership           47
company_size         0
revenue             15
salary               0
skills               0
dtype: int64

In [10]:
# check for duplicates
df.duplicated().sum()

0

In [12]:
#Get the dimensions of df
df.shape

(944, 13)

In [13]:
#Compute statistics
df.describe()

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
count,941,884,688,944,942,944,944,944,897,944,929,944,944
unique,4,4,3,420,431,42,197,8,2,510,312,896,400
top,data scientist,senior,on-site,company_134,"Bengaluru, Karnataka, India",a month ago,"San Francisco, CA, US",Technology,Public,900,Private,"€114,169",[]
freq,856,630,363,30,52,167,91,582,579,18,247,3,201

In [14]:
df['location']

0                                 Grapevine, TX . Hybrid
1                                Fort Worth, TX . Hybrid
2      Austin, TX . Toronto, Ontario, Canada . Kirkla...
3      Chicago, IL . Scottsdale, AZ . Austin, TX . Hy...
4                                                On-site
                             ...
939                          Bengaluru, Karnataka, India
940                       Melbourne, Victoria, Australia
941                                           McLean, VA
942                                         New York, NY
943                                        San Diego, CA
Name: location, Length: 944, dtype: object

In [17]:
df[df["job_title"].isnull()]

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
34,NaN,midlevel,NaN,company_064,"Barcelona, Catalonia, Spain",7 days ago,"Barcelona, CT, ES",Technology,NaN,900,Nonprofit,"€28,068","['git', 'r', 'python', 'linux', 'bash']"
247,NaN,midlevel,NaN,company_470,"Austin, TX",4 months ago,"Austin, TX, US",Education,NaN,"16,011",Education,"€68,505","['linux', 'python']"
509,NaN,lead,hybrid,company_946,"New York, NY . Hybrid",5 days ago,"New York, NY, US",Technology,Private,"52,380",Private,"€200,935 - €296,834","['aws', 'gcp', 'azure']"

In [22]:
#Fill the job title column
df['job_title'].fillna('Uknown', inplace=True)

In [20]:
# Check if the missing values have been filled
df[df['job_title'].isnull()]

Empty DataFrame
Columns: [job_title, seniority_level, status, company, location, post_date, headquarter, industry, ownership, company_size, revenue, salary, skills]
Index: []

In [23]:
#Fill the nulls in seniority level 
df['seniority_level'].fillna('Uknown', inplace=True)

In [25]:
# Check if the nulls have been filled
df[df['seniority_level'].isnull()]

Empty DataFrame
Columns: [job_title, seniority_level, status, company, location, post_date, headquarter, industry, ownership, company_size, revenue, salary, skills]
Index: []

In [26]:
df[df["status"].isnull()]

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
5,data scientist,lead,NaN,company_013,"New York, NY",3 months ago,"New York, NY, US",Technology,Private,150,€2.16B,"€196,371 - €251,170","['scikit-learn', 'python', 'scala', 'sql', 'ma..."
6,data scientist,junior,NaN,company_014,"Berkeley, CA",15 days ago,"Berkeley, CA, US",Education,NaN,"17,471",Education,"€51,330 - €70,144",[]
10,data scientist,senior,NaN,company_022,"Atlanta, GA",15 days ago,"Charlotte, NC, US",Technology,Public,"103,010",€128.13B,"€96,815","['pytorch', 'r', 'python', 'sql', 'machine lea..."
11,data scientist,midlevel,NaN,company_027,Greater Vancouver Metropolitan Area,6 days ago,"Vancouver, BC, CA",Education,NaN,240,Education,"€62,697 - €89,293","['java', 'git', 'python']"
16,data scientist,lead,NaN,company_038,"Bengaluru, Karnataka, India",6 days ago,"Kista, SE",Technology,Public,"132,000",€17.41B,"€52,746","['spark', 'aws', 'r', 'python', 'machine learn..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
933,machine learning engineer,midlevel,NaN,company_941,"Bengaluru, Karnataka, India . Bangalore, Karna...",21 days ago,"Dublin, IE",Technology,Public,"492,245",€154.21B,"€10,601 - €26,376",['machine learning']
934,data scientist,midlevel,NaN,company_881,"Singapore, Singapore",a month ago,CN,Technology,Private,"110,010",€129.04B,"€57,958 - €103,129","['sql', 'machine learning', 'r', 'python']"
936,data scientist,senior,NaN,company_844,"Mountain View, CA",8 days ago,"Mountain View, CA, US",Technology,Public,"17,050",€95.37B,"€170,195","['spark', 'r', 'python', 'sql', 'tableau']"
939,data scientist,senior,NaN,company_171,"Bengaluru, Karnataka, India",a day ago,"Armonk, NY, US",Technology,Public,"524,598",€120.29B,"€33,288 - €53,080","['pytorch', 'python', 'sql', 'machine learning..."
940,machine learning engineer,senior,NaN,company_134,"Melbourne, Victoria, Australia",a month ago,"Seattle, WA, US",Retail,Public,"865,456",€838.78B,"€64,290","['amazon', 'machine learning']"

In [27]:
df['status'].fillna("uknown", inplace=True)

In [28]:
df[df['status'].isnull()]

Empty DataFrame
Columns: [job_title, seniority_level, status, company, location, post_date, headquarter, industry, ownership, company_size, revenue, salary, skills]
Index: []

In [29]:
df[df['location'].isnull()]

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
174,machine learning engineer,senior,uknown,company_326,NaN,2 years ago,"Mumbai, MH, IN",Technology,Private,910,€7.41B,"€44,207",[]
201,machine learning engineer,lead,uknown,company_326,NaN,a year ago,"Mumbai, MH, IN",Technology,Private,910,€7.66B,"€44,202",[]

In [30]:
df['location'].fillna('uknown', inplace=True)

In [31]:
df[df['location'].isnull()]

Empty DataFrame
Columns: [job_title, seniority_level, status, company, location, post_date, headquarter, industry, ownership, company_size, revenue, salary, skills]
Index: []

In [33]:
#Select single column
df['ownership'].head(10)

0     Public
1     Public
2     Public
3     Public
4    Private
5    Private
6        NaN
7     Public
8    Private
9     Public
Name: ownership, dtype: object

In [34]:
df[df['ownership'].isnull()]

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
6,data scientist,junior,uknown,company_014,"Berkeley, CA",15 days ago,"Berkeley, CA, US",Education,NaN,"17,471",Education,"€51,330 - €70,144",[]
11,data scientist,midlevel,uknown,company_027,Greater Vancouver Metropolitan Area,6 days ago,"Vancouver, BC, CA",Education,NaN,240,Education,"€62,697 - €89,293","['java', 'git', 'python']"
28,data scientist,senior,on-site,company_051,"Laurel, MD",a month ago,"Laurel, MD, US",Technology,NaN,"8,010",Education,"€210,071",['python']
34,Uknown,midlevel,uknown,company_064,"Barcelona, Catalonia, Spain",7 days ago,"Barcelona, CT, ES",Technology,NaN,900,Nonprofit,"€28,068","['git', 'r', 'python', 'linux', 'bash']"
56,data scientist,midlevel,uknown,company_101,"Cambridge, England, United Kingdom",8 days ago,"Cambridge, GB",Education,NaN,"10,933",Education,"€31,175",[]
65,data scientist,midlevel,uknown,company_014,"Berkeley, CA",15 days ago,"Berkeley, CA, US",Education,NaN,"17,451",Education,"€82,193 - €122,141","['machine learning', 'database']"
116,data scientist,senior,on-site,company_226,"Rochester, New York Metropolitan Area",22 days ago,"Rochester, NY, US",Education,NaN,"9,320",Education,"€55,196 - €77,273","['deep learning', 'machine learning']"
223,data scientist,senior,remote,company_418,"Washington, United States . Idaho, United Stat...",7 days ago,"Seattle, WA, US",Finance,NaN,"2,810",Nonprofit,"€88,967 - €166,051","['tableau', 'sql', 'r', 'python']"
224,data scientist,midlevel,remote,company_421,Mexico City Metropolitan Area . Fully Remote,15 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,212","['sql', 'machine learning', 'python']"
237,data scientist,midlevel,remote,company_421,"São Paulo, São Paulo, Brazil . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,214","['sql', 'machine learning', 'python']"
238,data scientist,midlevel,on-site,company_456,"Sacramento, CA",19 days ago,"Sacramento, CA, US",Healthcare,NaN,"55,010",Nonprofit,"€115,891 - €172,882",[]
246,data scientist,senior,uknown,company_468,"Los Alamos, NM",14 days ago,"Los Alamos, NM, US",Energy,NaN,"12,802",Education,"€114,354 - €192,992","['git', 'r', 'python', 'sql', 'machine learnin..."
247,Uknown,midlevel,uknown,company_470,"Austin, TX",4 months ago,"Austin, TX, US",Education,NaN,"16,011",Education,"€68,505","['linux', 'python']"
251,machine learning engineer,senior,uknown,company_142,"New York, NY . Boston, MA . Los Angeles, CA",a year ago,"Cambridge, MA, US",Technology,NaN,Private,NaN,"€146,141 - €255,740","['pytorch', 'machine learning']"
252,data scientist,midlevel,hybrid,company_480,"Kansas City, KS . Hybrid",a month ago,"Kansas City, KS, US",Healthcare,NaN,"4,104",Education,"€75,814 - €119,654","['pytorch', 'r', 'python', 'machine learning',..."
259,data scientist,senior,uknown,company_488,"Boston, MA . บอสตัน, รัฐแมสซาชูเซตส์, สหรัฐ",25 days ago,"Boston, MA, US",Healthcare,NaN,"4,310",Nonprofit,"€138,543 - €173,111","['r', 'python', 'sql', 'machine learning', 'ta..."
288,data scientist,midlevel,on-site,company_579,"Philadelphia, PA",10 months ago,"Philadelphia, PA, US",Education,NaN,"39,879",Education,"€91,339 - €109,605","['sql', 'machine learning', 'r', 'python']"
297,data scientist,lead,uknown,company_598,Salt Lake City Metropolitan Area,7 days ago,"Salt Lake City, UT, US",Education,NaN,"9,030",Education,"€182,667","['sql', 'machine learning', 'python']"
299,data scientist,junior,uknown,company_603,"Queenstown, Central Singapore Community Develo...",3 months ago,"Singapore, SG",Education,NaN,210,Education,"€54,802","['tableau', 'r', 'python']"
327,data scientist,senior,uknown,company_666,"Singapore, Singapore",a month ago,SG,Technology,NaN,"6,040",Education,"€80,624",['database']
337,data scientist,lead,uknown,company_488,"Boston, MA",23 days ago,"Boston, MA, US",Healthcare,NaN,"4,270",Nonprofit,"€149,604 - €182,849","['r', 'python', 'sql', 'machine learning', 'ta..."
342,data scientist,junior,remote,company_702,"Dallas, TX",14 days ago,"Dallas, TX, US",Healthcare,NaN,"2,840",Nonprofit,"€43,700","['machine learning', 'r', 'python']"
373,data scientist,senior,on-site,company_793,"Pittsburgh, PA",2 months ago,"Pittsburgh, PA, US",Education,NaN,"12,609",Education,"€74,793",['machine learning']
379,data scientist,senior,hybrid,company_807,"Chicago, IL . Hybrid",7 days ago,"Chicago, IL, US",Healthcare,NaN,"1,570",Nonprofit,"€76,471 - €101,121","['r', 'python', 'java', 'sql', 'machine learni..."
380,data scientist,senior,on-site,company_226,"Henrietta, NY",3 months ago,"Rochester, NY, US",Education,NaN,"9,260",Education,"€64,121 - €96,177",['machine learning']
386,data scientist,senior,hybrid,company_817,United States . Hybrid,7 days ago,"New York, NY, US",Education,NaN,"3,510",Education,"€137,003 - €148,876","['pandas', 'aws', 'r', 'python', 'scikit-learn..."
387,data scientist,junior,uknown,company_819,"San Diego, CA",6 days ago,"San Diego, CA, US",Finance,NaN,600,Nonprofit,"€86,771 - €114,171","['pandas', 'numpy', 'pytorch', 'aws', 'r', 'py..."
391,data scientist,senior,remote,company_832,"Torrance, CA",7 days ago,"Renton, WA, US",Healthcare,NaN,"120,010",Nonprofit,"€159,835","['r', 'python', 'scala', 'sql', 'machine learn..."
405,data scientist,senior,remote,company_832,"Washington, United States",7 days ago,"Renton, WA, US",Healthcare,NaN,"120,040",Nonprofit,"€159,834","['r', 'python', 'scala', 'sql', 'machine learn..."
420,data scientist,midlevel,hybrid,company_793,"Pittsburgh, PA . Hybrid",a month ago,"Pittsburgh, PA, US",Education,NaN,"12,659",Education,"€44,521 - €59,359","['database', 'sql', 'r', 'python']"
450,data scientist,senior,uknown,company_603,"Queenstown, Central Singapore Community Develo...",a month ago,"Singapore, SG",Education,NaN,210,Education,"€54,804","['neural network', 'machine learning', 'r', 'p..."
458,data scientist,senior,hybrid,company_885,"Bethesda, MD . Hybrid",14 days ago,"Reston, VA, US",Technology,NaN,"1,060",Nonprofit,"€130,245 - €203,539","['sql', 'r', 'python']"
493,data scientist,senior,on-site,company_893,"Lexington, MA",8 days ago,"Heerlen, LI, NL",Technology,NaN,Private,NaN,"€117,553 - €159,840","['aws', 'git', 'r', 'python', 'docker']"
495,data scientist,midlevel,remote,company_421,"Charlotte, AR . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,211","['sql', 'machine learning', 'python']"
497,data scientist,senior,uknown,company_924,"Gainesville, FL",3 months ago,"Gainesville, FL, US",Education,NaN,"19,503",Education,"€55,715 - €58,455","['pandas', 'numpy', 'pytorch', 'r', 'python', ..."
543,data scientist,midlevel,remote,company_421,Brazil . Fully Remote,14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,211","['sql', 'machine learning', 'python']"
556,data scientist,junior,uknown,company_014,"Berkeley, CA",2 months ago,"Berkeley, CA, US",Education,NaN,"17,441",Education,"€99,741 - €189,795",['machine learning']
557,data scientist,midlevel,remote,company_421,"Santo Domingo, Dominican Republic . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,216","['sql', 'machine learning', 'python']"
576,data scientist,senior,remote,company_421,"Lima, Peru",5 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€7,679","['pandas', 'numpy', 'python', 'sklearn', 'mach..."
611,data scientist,midlevel,remote,company_421,"San Juan, Puerto Rico . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,214","['sql', 'machine learning', 'python']"
635,data scientist,senior,remote,company_421,"Bogota, D.C., Capital District, Colombia",5 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€7,680","['pandas', 'numpy', 'python', 'sklearn', 'mach..."
679,data scientist,senior,remote,company_421,Mexico City Metropolitan Area,5 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€7,678","['pandas', 'numpy', 'python', 'sklearn', 'mach..."
705,data scientist,midlevel,remote,company_421,"Belize City, Belize, Belize . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,214","['sql', 'machine learning', 'python']"
768,data scientist,midlevel,remote,company_421,"San Salvador, San Salvador, El Salvador . Full...",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,213","['sql', 'machine learning', 'python']"
785,data scientist,senior,remote,company_832,"California, United States",8 days ago,"Renton, WA, US",Healthcare,NaN,"120,050",Nonprofit,"€159,841","['r', 'python', 'scala', 'sql', 'machine learn..."
800,data scientist,midlevel,remote,company_421,"Quito, Pichincha, Ecuador . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,216","['sql', 'machine learning', 'python']"
801,data scientist,midlevel,remote,company_421,"Podgorica, Montenegro . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,NaN,Private,NaN,"€25,212","['sql', 'machine learning', 'python']"

In [35]:
df['ownership'].fillna('uknown', inplace=True)

In [38]:
df[df['ownership'].isnull()]

Empty DataFrame
Columns: [job_title, seniority_level, status, company, location, post_date, headquarter, industry, ownership, company_size, revenue, salary, skills]
Index: []

In [40]:
df[df['revenue'].isnull()].head()

,job_title,seniority_level,status,company,location,post_date,headquarter,industry,ownership,company_size,revenue,salary,skills
224,data scientist,midlevel,remote,company_421,Mexico City Metropolitan Area . Fully Remote,15 days ago,"Cheyenne, WY, US",Technology,uknown,Private,NaN,"€25,212","['sql', 'machine learning', 'python']"
237,data scientist,midlevel,remote,company_421,"São Paulo, São Paulo, Brazil . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,uknown,Private,NaN,"€25,214","['sql', 'machine learning', 'python']"
251,machine learning engineer,senior,uknown,company_142,"New York, NY . Boston, MA . Los Angeles, CA",a year ago,"Cambridge, MA, US",Technology,uknown,Private,NaN,"€146,141 - €255,740","['pytorch', 'machine learning']"
493,data scientist,senior,on-site,company_893,"Lexington, MA",8 days ago,"Heerlen, LI, NL",Technology,uknown,Private,NaN,"€117,553 - €159,840","['aws', 'git', 'r', 'python', 'docker']"
495,data scientist,midlevel,remote,company_421,"Charlotte, AR . Fully Remote",14 days ago,"Cheyenne, WY, US",Technology,uknown,Private,NaN,"€25,211","['sql', 'machine learning', 'python']"

In [41]:
df[df['revenue'].fillna('0', inplace=True)]

KeyError: None